Revit 2024 API
WireConduitTypeSet.Erase Method
Removes a specified conduit type from the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	WireConduitType item
)
Visual Basic
Public Overridable Function Erase ( _
	item As WireConduitType _
) As Integer
Visual C++
public:
virtual int Erase(
	WireConduitType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.WireConduitType
The conduit type to be erased.
Return Value
The number of conduit types that were erased from the set.
See Also
WireConduitTypeSet Class
Autodesk.Revit.DB.Electrical Namespace